nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/*
 * File:           C:\Users\jberlin\OneDrive - Analog Devices, Inc\SigmaDSP with Microcontrollers\SIMPLE SigmaDSP Teensy Project\lib\SigmaStudio\Simple_SS_Project_145x_146x_IC_1_REG.h
 *
 * Created:        Wednesday, April 1, 2020 12:00:59 PM
 * Description:    Simple_SS_Project_145x_146x:IC 1 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2020 Analog Devices, Inc. All rights reserved.
 */
#ifndef __SIMPLE_SS_PROJECT_145X_146X_IC_1_REG_H__
#define __SIMPLE_SS_PROJECT_145X_146X_IC_1_REG_H__


/* PLL_CTRL0  - Registers (IC 1) */
#define REG_PLL_CTRL0_IC_1_ADDR                   0xF000
#define REG_PLL_CTRL0_IC_1_BYTE                   2
#define REG_PLL_CTRL0_IC_1_VALUE                  0x60

/* PLL_CTRL1  - Registers (IC 1) */
#define REG_PLL_CTRL1_IC_1_ADDR                   0xF001
#define REG_PLL_CTRL1_IC_1_BYTE                   2
#define REG_PLL_CTRL1_IC_1_VALUE                  0x2

/* PLL_CLK_SRC  - Registers (IC 1) */
#define REG_PLL_CLK_SRC_IC_1_ADDR                 0xF002
#define REG_PLL_CLK_SRC_IC_1_BYTE                 2
#define REG_PLL_CLK_SRC_IC_1_VALUE                0x1

/* PLL_ENABLE  - Registers (IC 1) */
#define REG_PLL_ENABLE_IC_1_ADDR                  0xF003
#define REG_PLL_ENABLE_IC_1_BYTE                  2
#define REG_PLL_ENABLE_IC_1_VALUE                 0x1

/* PLL_LOCK  - Registers (IC 1) */
#define REG_PLL_LOCK_IC_1_ADDR                    0xF004
#define REG_PLL_LOCK_IC_1_BYTE                    0
#define REG_PLL_LOCK_IC_1_VALUE                   0x0

/* MCLK_OUT  - Registers (IC 1) */
#define REG_MCLK_OUT_IC_1_ADDR                    0xF005
#define REG_MCLK_OUT_IC_1_BYTE                    2
#define REG_MCLK_OUT_IC_1_VALUE                   0x5

/* PLL_WATCHDOG  - Registers (IC 1) */
#define REG_PLL_WATCHDOG_IC_1_ADDR                0xF006
#define REG_PLL_WATCHDOG_IC_1_BYTE                2
#define REG_PLL_WATCHDOG_IC_1_VALUE               0x1

/* CLK_GEN1_M  - Registers (IC 1) */
#define REG_CLK_GEN1_M_IC_1_ADDR                  0xF020
#define REG_CLK_GEN1_M_IC_1_BYTE                  2
#define REG_CLK_GEN1_M_IC_1_VALUE                 0x6

/* CLK_GEN1_N  - Registers (IC 1) */
#define REG_CLK_GEN1_N_IC_1_ADDR                  0xF021
#define REG_CLK_GEN1_N_IC_1_BYTE                  2
#define REG_CLK_GEN1_N_IC_1_VALUE                 0x1

/* CLK_GEN2_M  - Registers (IC 1) */
#define REG_CLK_GEN2_M_IC_1_ADDR                  0xF022
#define REG_CLK_GEN2_M_IC_1_BYTE                  2
#define REG_CLK_GEN2_M_IC_1_VALUE                 0x9

/* CLK_GEN2_N  - Registers (IC 1) */
#define REG_CLK_GEN2_N_IC_1_ADDR                  0xF023
#define REG_CLK_GEN2_N_IC_1_BYTE                  2
#define REG_CLK_GEN2_N_IC_1_VALUE                 0x1

/* CLK_GEN3_M  - Registers (IC 1) */
#define REG_CLK_GEN3_M_IC_1_ADDR                  0xF024
#define REG_CLK_GEN3_M_IC_1_BYTE                  2
#define REG_CLK_GEN3_M_IC_1_VALUE                 0x0

/* CLK_GEN3_N  - Registers (IC 1) */
#define REG_CLK_GEN3_N_IC_1_ADDR                  0xF025
#define REG_CLK_GEN3_N_IC_1_BYTE                  2
#define REG_CLK_GEN3_N_IC_1_VALUE                 0x0

/* CLK_GEN3_SRC  - Registers (IC 1) */
#define REG_CLK_GEN3_SRC_IC_1_ADDR                0xF026
#define REG_CLK_GEN3_SRC_IC_1_BYTE                2
#define REG_CLK_GEN3_SRC_IC_1_VALUE               0xE

/* CLK_GEN3_LOCK  - Registers (IC 1) */
#define REG_CLK_GEN3_LOCK_IC_1_ADDR               0xF027
#define REG_CLK_GEN3_LOCK_IC_1_BYTE               0
#define REG_CLK_GEN3_LOCK_IC_1_VALUE              0x0

/* POWER_ENABLE0  - Registers (IC 1) */
#define REG_POWER_ENABLE0_IC_1_ADDR               0xF050
#define REG_POWER_ENABLE0_IC_1_BYTE               2
#define REG_POWER_ENABLE0_IC_1_VALUE              0x1FFF

/* POWER_ENABLE1  - Registers (IC 1) */
#define REG_POWER_ENABLE1_IC_1_ADDR               0xF051
#define REG_POWER_ENABLE1_IC_1_BYTE               2
#define REG_POWER_ENABLE1_IC_1_VALUE              0x1F

/* ASRC_INPUT0  - Registers (IC 1) */
#define REG_ASRC_INPUT0_IC_1_ADDR                 0xF100
#define REG_ASRC_INPUT0_IC_1_BYTE                 2
#define REG_ASRC_INPUT0_IC_1_VALUE                0xA1

/* ASRC_INPUT1  - Registers (IC 1) */
#define REG_ASRC_INPUT1_IC_1_ADDR                 0xF101
#define REG_ASRC_INPUT1_IC_1_BYTE                 2
#define REG_ASRC_INPUT1_IC_1_VALUE                0x0

/* ASRC_INPUT2  - Registers (IC 1) */
#define REG_ASRC_INPUT2_IC_1_ADDR                 0xF102
#define REG_ASRC_INPUT2_IC_1_BYTE                 2
#define REG_ASRC_INPUT2_IC_1_VALUE                0x0

/* ASRC_INPUT3  - Registers (IC 1) */
#define REG_ASRC_INPUT3_IC_1_ADDR                 0xF103
#define REG_ASRC_INPUT3_IC_1_BYTE                 2
#define REG_ASRC_INPUT3_IC_1_VALUE                0x0

/* ASRC_INPUT4  - Registers (IC 1) */
#define REG_ASRC_INPUT4_IC_1_ADDR                 0xF104
#define REG_ASRC_INPUT4_IC_1_BYTE                 2
#define REG_ASRC_INPUT4_IC_1_VALUE                0x0

/* ASRC_INPUT5  - Registers (IC 1) */
#define REG_ASRC_INPUT5_IC_1_ADDR                 0xF105
#define REG_ASRC_INPUT5_IC_1_BYTE                 2
#define REG_ASRC_INPUT5_IC_1_VALUE                0x0

/* ASRC_INPUT6  - Registers (IC 1) */
#define REG_ASRC_INPUT6_IC_1_ADDR                 0xF106
#define REG_ASRC_INPUT6_IC_1_BYTE                 2
#define REG_ASRC_INPUT6_IC_1_VALUE                0x0

