nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* FTDM_OUT41  - Registers (IC 1) */
#define REG_FTDM_OUT41_IC_1_ADDR                  0xF3A9
#define REG_FTDM_OUT41_IC_1_BYTE                  2
#define REG_FTDM_OUT41_IC_1_VALUE                 0x0

/* FTDM_OUT42  - Registers (IC 1) */
#define REG_FTDM_OUT42_IC_1_ADDR                  0xF3AA
#define REG_FTDM_OUT42_IC_1_BYTE                  2
#define REG_FTDM_OUT42_IC_1_VALUE                 0x0

/* FTDM_OUT43  - Registers (IC 1) */
#define REG_FTDM_OUT43_IC_1_ADDR                  0xF3AB
#define REG_FTDM_OUT43_IC_1_BYTE                  2
#define REG_FTDM_OUT43_IC_1_VALUE                 0x0

/* FTDM_OUT44  - Registers (IC 1) */
#define REG_FTDM_OUT44_IC_1_ADDR                  0xF3AC
#define REG_FTDM_OUT44_IC_1_BYTE                  2
#define REG_FTDM_OUT44_IC_1_VALUE                 0x0

/* FTDM_OUT45  - Registers (IC 1) */
#define REG_FTDM_OUT45_IC_1_ADDR                  0xF3AD
#define REG_FTDM_OUT45_IC_1_BYTE                  2
#define REG_FTDM_OUT45_IC_1_VALUE                 0x0

/* FTDM_OUT46  - Registers (IC 1) */
#define REG_FTDM_OUT46_IC_1_ADDR                  0xF3AE
#define REG_FTDM_OUT46_IC_1_BYTE                  2
#define REG_FTDM_OUT46_IC_1_VALUE                 0x0

/* FTDM_OUT47  - Registers (IC 1) */
#define REG_FTDM_OUT47_IC_1_ADDR                  0xF3AF
#define REG_FTDM_OUT47_IC_1_BYTE                  2
#define REG_FTDM_OUT47_IC_1_VALUE                 0x0

/* FTDM_OUT48  - Registers (IC 1) */
#define REG_FTDM_OUT48_IC_1_ADDR                  0xF3B0
#define REG_FTDM_OUT48_IC_1_BYTE                  2
#define REG_FTDM_OUT48_IC_1_VALUE                 0x0

/* FTDM_OUT49  - Registers (IC 1) */
#define REG_FTDM_OUT49_IC_1_ADDR                  0xF3B1
#define REG_FTDM_OUT49_IC_1_BYTE                  2
#define REG_FTDM_OUT49_IC_1_VALUE                 0x0

/* FTDM_OUT50  - Registers (IC 1) */
#define REG_FTDM_OUT50_IC_1_ADDR                  0xF3B2
#define REG_FTDM_OUT50_IC_1_BYTE                  2
#define REG_FTDM_OUT50_IC_1_VALUE                 0x0

/* FTDM_OUT51  - Registers (IC 1) */
#define REG_FTDM_OUT51_IC_1_ADDR                  0xF3B3
#define REG_FTDM_OUT51_IC_1_BYTE                  2
#define REG_FTDM_OUT51_IC_1_VALUE                 0x0

/* FTDM_OUT52  - Registers (IC 1) */
#define REG_FTDM_OUT52_IC_1_ADDR                  0xF3B4
#define REG_FTDM_OUT52_IC_1_BYTE                  2
#define REG_FTDM_OUT52_IC_1_VALUE                 0x0

/* FTDM_OUT53  - Registers (IC 1) */
#define REG_FTDM_OUT53_IC_1_ADDR                  0xF3B5
#define REG_FTDM_OUT53_IC_1_BYTE                  2
#define REG_FTDM_OUT53_IC_1_VALUE                 0x0

/* FTDM_OUT54  - Registers (IC 1) */
#define REG_FTDM_OUT54_IC_1_ADDR                  0xF3B6
#define REG_FTDM_OUT54_IC_1_BYTE                  2
#define REG_FTDM_OUT54_IC_1_VALUE                 0x0

/* FTDM_OUT55  - Registers (IC 1) */
#define REG_FTDM_OUT55_IC_1_ADDR                  0xF3B7
#define REG_FTDM_OUT55_IC_1_BYTE                  2
#define REG_FTDM_OUT55_IC_1_VALUE                 0x0

/* FTDM_OUT56  - Registers (IC 1) */
#define REG_FTDM_OUT56_IC_1_ADDR                  0xF3B8
#define REG_FTDM_OUT56_IC_1_BYTE                  2
#define REG_FTDM_OUT56_IC_1_VALUE                 0x0

/* FTDM_OUT57  - Registers (IC 1) */
#define REG_FTDM_OUT57_IC_1_ADDR                  0xF3B9
#define REG_FTDM_OUT57_IC_1_BYTE                  2
#define REG_FTDM_OUT57_IC_1_VALUE                 0x0

/* FTDM_OUT58  - Registers (IC 1) */
#define REG_FTDM_OUT58_IC_1_ADDR                  0xF3BA
#define REG_FTDM_OUT58_IC_1_BYTE                  2
#define REG_FTDM_OUT58_IC_1_VALUE                 0x0

/* FTDM_OUT59  - Registers (IC 1) */
#define REG_FTDM_OUT59_IC_1_ADDR                  0xF3BB
#define REG_FTDM_OUT59_IC_1_BYTE                  2
#define REG_FTDM_OUT59_IC_1_VALUE                 0x0

/* FTDM_OUT60  - Registers (IC 1) */
#define REG_FTDM_OUT60_IC_1_ADDR                  0xF3BC
#define REG_FTDM_OUT60_IC_1_BYTE                  2
#define REG_FTDM_OUT60_IC_1_VALUE                 0x0

/* FTDM_OUT61  - Registers (IC 1) */
#define REG_FTDM_OUT61_IC_1_ADDR                  0xF3BD
#define REG_FTDM_OUT61_IC_1_BYTE                  2
#define REG_FTDM_OUT61_IC_1_VALUE                 0x0

/* FTDM_OUT62  - Registers (IC 1) */
#define REG_FTDM_OUT62_IC_1_ADDR                  0xF3BE
#define REG_FTDM_OUT62_IC_1_BYTE                  2
#define REG_FTDM_OUT62_IC_1_VALUE                 0x0

/* FTDM_OUT63  - Registers (IC 1) */
#define REG_FTDM_OUT63_IC_1_ADDR                  0xF3BF
#define REG_FTDM_OUT63_IC_1_BYTE                  2
#define REG_FTDM_OUT63_IC_1_VALUE                 0x0

/* HIBERNATE  - Registers (IC 1) */
#define REG_HIBERNATE_IC_1_ADDR                   0xF400
#define REG_HIBERNATE_IC_1_BYTE                   2
#define REG_HIBERNATE_IC_1_VALUE                  0x0

/* START_PULSE  - Registers (IC 1) */
#define REG_START_PULSE_IC_1_ADDR                 0xF401
#define REG_START_PULSE_IC_1_BYTE                 2
#define REG_START_PULSE_IC_1_VALUE                0x2

/* START_CORE  - Registers (IC 1) */
#define REG_START_CORE_IC_1_ADDR                  0xF402
#define REG_START_CORE_IC_1_BYTE                  2
#define REG_START_CORE_IC_1_VALUE                 0x1

/* KILL_CORE  - Registers (IC 1) */
#define REG_KILL_CORE_IC_1_ADDR                   0xF403
#define REG_KILL_CORE_IC_1_BYTE                   2
#define REG_KILL_CORE_IC_1_VALUE                  0x0

/* START_ADDRESS  - Registers (IC 1) */
#define REG_START_ADDRESS_IC_1_ADDR               0xF404
#define REG_START_ADDRESS_IC_1_BYTE               2
#define REG_START_ADDRESS_IC_1_VALUE              0x0

/* CORE_STATUS  - Registers (IC 1) */
#define REG_CORE_STATUS_IC_1_ADDR                 0xF405
#define REG_CORE_STATUS_IC_1_BYTE                 0
#define REG_CORE_STATUS_IC_1_VALUE                0x0

/* PANIC_CLEAR  - Registers (IC 1) */
#define REG_PANIC_CLEAR_IC_1_ADDR                 0xF421
#define REG_PANIC_CLEAR_IC_1_BYTE                 2
#define REG_PANIC_CLEAR_IC_1_VALUE                0x0

/* PANIC_PARITY_MASK  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK_IC_1_ADDR           0xF422
#define REG_PANIC_PARITY_MASK_IC_1_BYTE           2
#define REG_PANIC_PARITY_MASK_IC_1_VALUE          0x3

