nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* SDATA_1_ROUTE (IC 1) */
#define R75_SDATA_1_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R75_SDATA_1_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R75_SDATA_1_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R75_SDATA_1_ROUTE_ENBL_IC_1               0x0    /* 0b	[5] */
#define R75_SDATA_1_ROUTE_CHAN_IC_1_MASK          0x3
#define R75_SDATA_1_ROUTE_CHAN_IC_1_SHIFT         0
#define R75_SDATA_1_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R75_SDATA_1_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R75_SDATA_1_ROUTE_DIR_IC_1_MASK           0x10
#define R75_SDATA_1_ROUTE_DIR_IC_1_SHIFT          4
#define R75_SDATA_1_ROUTE_ENBL_IC_1_MASK          0x20
#define R75_SDATA_1_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_2_ROUTE (IC 1) */
#define R76_SDATA_2_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R76_SDATA_2_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R76_SDATA_2_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R76_SDATA_2_ROUTE_ENBL_IC_1               0x0    /* 0b	[5] */
#define R76_SDATA_2_ROUTE_CHAN_IC_1_MASK          0x3
#define R76_SDATA_2_ROUTE_CHAN_IC_1_SHIFT         0
#define R76_SDATA_2_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R76_SDATA_2_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R76_SDATA_2_ROUTE_DIR_IC_1_MASK           0x10
#define R76_SDATA_2_ROUTE_DIR_IC_1_SHIFT          4
#define R76_SDATA_2_ROUTE_ENBL_IC_1_MASK          0x20
#define R76_SDATA_2_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_3_ROUTE (IC 1) */
#define R77_SDATA_3_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R77_SDATA_3_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R77_SDATA_3_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R77_SDATA_3_ROUTE_ENBL_IC_1               0x0    /* 0b	[5] */
#define R77_SDATA_3_ROUTE_CHAN_IC_1_MASK          0x3
#define R77_SDATA_3_ROUTE_CHAN_IC_1_SHIFT         0
#define R77_SDATA_3_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R77_SDATA_3_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R77_SDATA_3_ROUTE_DIR_IC_1_MASK           0x10
#define R77_SDATA_3_ROUTE_DIR_IC_1_SHIFT          4
#define R77_SDATA_3_ROUTE_ENBL_IC_1_MASK          0x20
#define R77_SDATA_3_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_4_ROUTE (IC 1) */
#define R78_SDATA_4_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R78_SDATA_4_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R78_SDATA_4_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R78_SDATA_4_ROUTE_ENBL_IC_1               0x0    /* 0b	[5] */
#define R78_SDATA_4_ROUTE_CHAN_IC_1_MASK          0x3
#define R78_SDATA_4_ROUTE_CHAN_IC_1_SHIFT         0
#define R78_SDATA_4_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R78_SDATA_4_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R78_SDATA_4_ROUTE_DIR_IC_1_MASK           0x10
#define R78_SDATA_4_ROUTE_DIR_IC_1_SHIFT          4
#define R78_SDATA_4_ROUTE_ENBL_IC_1_MASK          0x20
#define R78_SDATA_4_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_5_ROUTE (IC 1) */
#define R79_SDATA_5_ROUTE_CHAN_IC_1               0x0    /* 00b	[1:0] */
#define R79_SDATA_5_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R79_SDATA_5_ROUTE_DIR_IC_1                0x1    /* 1b	[4] */
#define R79_SDATA_5_ROUTE_ENBL_IC_1               0x1    /* 1b	[5] */
#define R79_SDATA_5_ROUTE_CHAN_IC_1_MASK          0x3
#define R79_SDATA_5_ROUTE_CHAN_IC_1_SHIFT         0
#define R79_SDATA_5_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R79_SDATA_5_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R79_SDATA_5_ROUTE_DIR_IC_1_MASK           0x10
#define R79_SDATA_5_ROUTE_DIR_IC_1_SHIFT          4
#define R79_SDATA_5_ROUTE_ENBL_IC_1_MASK          0x20
#define R79_SDATA_5_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_6_ROUTE (IC 1) */
#define R80_SDATA_6_ROUTE_CHAN_IC_1               0x1    /* 01b	[1:0] */
#define R80_SDATA_6_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R80_SDATA_6_ROUTE_DIR_IC_1                0x1    /* 1b	[4] */
#define R80_SDATA_6_ROUTE_ENBL_IC_1               0x1    /* 1b	[5] */
#define R80_SDATA_6_ROUTE_CHAN_IC_1_MASK          0x3
#define R80_SDATA_6_ROUTE_CHAN_IC_1_SHIFT         0
#define R80_SDATA_6_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R80_SDATA_6_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R80_SDATA_6_ROUTE_DIR_IC_1_MASK           0x10
#define R80_SDATA_6_ROUTE_DIR_IC_1_SHIFT          4
#define R80_SDATA_6_ROUTE_ENBL_IC_1_MASK          0x20
#define R80_SDATA_6_ROUTE_ENBL_IC_1_SHIFT         5

/* SDATA_7_ROUTE (IC 1) */
#define R81_SDATA_7_ROUTE_CHAN_IC_1               0x2    /* 10b	[1:0] */
#define R81_SDATA_7_ROUTE_PORT_SEL_IC_1           0x0    /* 00b	[3:2] */
#define R81_SDATA_7_ROUTE_DIR_IC_1                0x0    /* 0b	[4] */
#define R81_SDATA_7_ROUTE_ENBL_IC_1               0x1    /* 1b	[5] */
#define R81_SDATA_7_ROUTE_CHAN_IC_1_MASK          0x3
#define R81_SDATA_7_ROUTE_CHAN_IC_1_SHIFT         0
#define R81_SDATA_7_ROUTE_PORT_SEL_IC_1_MASK      0xC
#define R81_SDATA_7_ROUTE_PORT_SEL_IC_1_SHIFT     2
#define R81_SDATA_7_ROUTE_DIR_IC_1_MASK           0x10
#define R81_SDATA_7_ROUTE_DIR_IC_1_SHIFT          4
#define R81_SDATA_7_ROUTE_ENBL_IC_1_MASK          0x20
#define R81_SDATA_7_ROUTE_ENBL_IC_1_SHIFT         5

/* FTDM_IN0 (IC 1) */
#define R82_FTDM_IN0_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R82_FTDM_IN0_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R82_FTDM_IN0_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R82_FTDM_IN0_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R82_FTDM_IN0_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R82_FTDM_IN0_BYTE_IN_POS_IC_1_MASK        0x3
#define R82_FTDM_IN0_BYTE_IN_POS_IC_1_SHIFT       0
#define R82_FTDM_IN0_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R82_FTDM_IN0_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R82_FTDM_IN0_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R82_FTDM_IN0_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R82_FTDM_IN0_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R82_FTDM_IN0_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R82_FTDM_IN0_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R82_FTDM_IN0_SLOT_ENABLE_IN_IC_1_SHIFT    7

/* FTDM_IN1 (IC 1) */
#define R83_FTDM_IN1_BYTE_IN_POS_IC_1             0x0    /* 00b	[1:0] */
#define R83_FTDM_IN1_CHANNEL_IN_POS_IC_1          0x0    /* 000b	[4:2] */
#define R83_FTDM_IN1_SERIAL_IN_SEL_IC_1           0x0    /* 0b	[5] */
#define R83_FTDM_IN1_REVERSE_IN_BYTE_IC_1         0x0    /* 0b	[6] */
#define R83_FTDM_IN1_SLOT_ENABLE_IN_IC_1          0x0    /* 0b	[7] */
#define R83_FTDM_IN1_BYTE_IN_POS_IC_1_MASK        0x3
#define R83_FTDM_IN1_BYTE_IN_POS_IC_1_SHIFT       0
#define R83_FTDM_IN1_CHANNEL_IN_POS_IC_1_MASK     0x1C
#define R83_FTDM_IN1_CHANNEL_IN_POS_IC_1_SHIFT    2
#define R83_FTDM_IN1_SERIAL_IN_SEL_IC_1_MASK      0x20
#define R83_FTDM_IN1_SERIAL_IN_SEL_IC_1_SHIFT     5
#define R83_FTDM_IN1_REVERSE_IN_BYTE_IC_1_MASK    0x40
#define R83_FTDM_IN1_REVERSE_IN_BYTE_IC_1_SHIFT   6
#define R83_FTDM_IN1_SLOT_ENABLE_IN_IC_1_MASK     0x80
#define R83_FTDM_IN1_SLOT_ENABLE_IN_IC_1_SHIFT    7

