nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* FTDM_OUT32 (IC 1) */
#define R178_FTDM_OUT32_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R178_FTDM_OUT32_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R178_FTDM_OUT32_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R178_FTDM_OUT32_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R178_FTDM_OUT32_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R178_FTDM_OUT32_BYTE_OUT_POS_IC_1_MASK    0x3
#define R178_FTDM_OUT32_BYTE_OUT_POS_IC_1_SHIFT   0
#define R178_FTDM_OUT32_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R178_FTDM_OUT32_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R178_FTDM_OUT32_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R178_FTDM_OUT32_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R178_FTDM_OUT32_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R178_FTDM_OUT32_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R178_FTDM_OUT32_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R178_FTDM_OUT32_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT33 (IC 1) */
#define R179_FTDM_OUT33_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R179_FTDM_OUT33_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R179_FTDM_OUT33_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R179_FTDM_OUT33_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R179_FTDM_OUT33_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R179_FTDM_OUT33_BYTE_OUT_POS_IC_1_MASK    0x3
#define R179_FTDM_OUT33_BYTE_OUT_POS_IC_1_SHIFT   0
#define R179_FTDM_OUT33_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R179_FTDM_OUT33_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R179_FTDM_OUT33_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R179_FTDM_OUT33_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R179_FTDM_OUT33_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R179_FTDM_OUT33_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R179_FTDM_OUT33_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R179_FTDM_OUT33_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT34 (IC 1) */
#define R180_FTDM_OUT34_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R180_FTDM_OUT34_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R180_FTDM_OUT34_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R180_FTDM_OUT34_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R180_FTDM_OUT34_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R180_FTDM_OUT34_BYTE_OUT_POS_IC_1_MASK    0x3
#define R180_FTDM_OUT34_BYTE_OUT_POS_IC_1_SHIFT   0
#define R180_FTDM_OUT34_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R180_FTDM_OUT34_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R180_FTDM_OUT34_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R180_FTDM_OUT34_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R180_FTDM_OUT34_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R180_FTDM_OUT34_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R180_FTDM_OUT34_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R180_FTDM_OUT34_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT35 (IC 1) */
#define R181_FTDM_OUT35_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R181_FTDM_OUT35_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R181_FTDM_OUT35_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R181_FTDM_OUT35_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R181_FTDM_OUT35_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R181_FTDM_OUT35_BYTE_OUT_POS_IC_1_MASK    0x3
#define R181_FTDM_OUT35_BYTE_OUT_POS_IC_1_SHIFT   0
#define R181_FTDM_OUT35_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R181_FTDM_OUT35_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R181_FTDM_OUT35_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R181_FTDM_OUT35_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R181_FTDM_OUT35_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R181_FTDM_OUT35_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R181_FTDM_OUT35_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R181_FTDM_OUT35_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT36 (IC 1) */
#define R182_FTDM_OUT36_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R182_FTDM_OUT36_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R182_FTDM_OUT36_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R182_FTDM_OUT36_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R182_FTDM_OUT36_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R182_FTDM_OUT36_BYTE_OUT_POS_IC_1_MASK    0x3
#define R182_FTDM_OUT36_BYTE_OUT_POS_IC_1_SHIFT   0
#define R182_FTDM_OUT36_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R182_FTDM_OUT36_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R182_FTDM_OUT36_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R182_FTDM_OUT36_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R182_FTDM_OUT36_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R182_FTDM_OUT36_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R182_FTDM_OUT36_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R182_FTDM_OUT36_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT37 (IC 1) */
#define R183_FTDM_OUT37_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R183_FTDM_OUT37_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R183_FTDM_OUT37_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R183_FTDM_OUT37_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R183_FTDM_OUT37_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R183_FTDM_OUT37_BYTE_OUT_POS_IC_1_MASK    0x3
#define R183_FTDM_OUT37_BYTE_OUT_POS_IC_1_SHIFT   0
#define R183_FTDM_OUT37_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R183_FTDM_OUT37_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R183_FTDM_OUT37_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R183_FTDM_OUT37_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R183_FTDM_OUT37_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R183_FTDM_OUT37_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R183_FTDM_OUT37_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R183_FTDM_OUT37_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT38 (IC 1) */
#define R184_FTDM_OUT38_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R184_FTDM_OUT38_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R184_FTDM_OUT38_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R184_FTDM_OUT38_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R184_FTDM_OUT38_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R184_FTDM_OUT38_BYTE_OUT_POS_IC_1_MASK    0x3
#define R184_FTDM_OUT38_BYTE_OUT_POS_IC_1_SHIFT   0
#define R184_FTDM_OUT38_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R184_FTDM_OUT38_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R184_FTDM_OUT38_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R184_FTDM_OUT38_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R184_FTDM_OUT38_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R184_FTDM_OUT38_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R184_FTDM_OUT38_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R184_FTDM_OUT38_SLOT_ENABLE_OUT_IC_1_SHIFT 7

