nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* MP4_READ1 (IC 1) */
#define R345_MP4_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R345_MP4_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R345_MP4_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP5_READ1 (IC 1) */
#define R346_MP5_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R346_MP5_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R346_MP5_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP6_READ1 (IC 1) */
#define R347_MP6_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R347_MP6_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R347_MP6_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP7_READ1 (IC 1) */
#define R348_MP7_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R348_MP7_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R348_MP7_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP8_READ1 (IC 1) */
#define R349_MP8_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R349_MP8_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R349_MP8_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP9_READ1 (IC 1) */
#define R350_MP9_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R350_MP9_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R350_MP9_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP10_READ1 (IC 1) */
#define R351_MP10_READ1_MP_REG_READ1_IC_1         0x0    /* 0b	[0] */
#define R351_MP10_READ1_MP_REG_READ1_IC_1_MASK    0x1
#define R351_MP10_READ1_MP_REG_READ1_IC_1_SHIFT   0

/* MP11_READ1 (IC 1) */
#define R352_MP11_READ1_MP_REG_READ1_IC_1         0x0    /* 0b	[0] */
#define R352_MP11_READ1_MP_REG_READ1_IC_1_MASK    0x1
#define R352_MP11_READ1_MP_REG_READ1_IC_1_SHIFT   0

/* SECONDARY_I2C (IC 1) */
#define R353_SECONDARY_I2C_SECONDARY_I2C_ENBL_IC_1 0x0   /* 0b	[0] */
#define R353_SECONDARY_I2C_SECONDARY_I2C_ENBL_IC_1_MASK 0x1
#define R353_SECONDARY_I2C_SECONDARY_I2C_ENBL_IC_1_SHIFT 0

/* SPDIF_LOCK_DET (IC 1) */
#define R354_SPDIF_LOCK_DET_LOCK_IC_1             0x0    /* 0b	[0] */
#define R354_SPDIF_LOCK_DET_LOCK_IC_1_MASK        0x1
#define R354_SPDIF_LOCK_DET_LOCK_IC_1_SHIFT       0

/* SPDIF_RX_CTRL (IC 1) */
#define R355_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1     0x0    /* 00b	[1:0] */
#define R355_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1     0x0    /* 0b	[2] */
#define R355_SPDIF_RX_CTRL_FASTLOCK_IC_1          0x0    /* 0b	[3] */
#define R355_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1_MASK 0x3
#define R355_SPDIF_RX_CTRL_RX_LENGTHCTRL_IC_1_SHIFT 0
#define R355_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1_MASK 0x4
#define R355_SPDIF_RX_CTRL_FSOUTSTRENGTH_IC_1_SHIFT 2
#define R355_SPDIF_RX_CTRL_FASTLOCK_IC_1_MASK     0x8
#define R355_SPDIF_RX_CTRL_FASTLOCK_IC_1_SHIFT    3

/* SPDIF_RX_DECODE (IC 1) */
#define R356_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1      0x0    /* 0b	[0] */
#define R356_SPDIF_RX_DECODE_COMPR_TYPE_IC_1      0x0    /* 0b	[1] */
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1 0x2    /* 0010b	[5:2] */
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1 0x2    /* 0010b	[9:6] */
#define R356_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1_MASK 0x1
#define R356_SPDIF_RX_DECODE_AUDIO_TYPE_IC_1_SHIFT 0
#define R356_SPDIF_RX_DECODE_COMPR_TYPE_IC_1_MASK 0x2
#define R356_SPDIF_RX_DECODE_COMPR_TYPE_IC_1_SHIFT 1
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1_MASK 0x3C
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_L_IC_1_SHIFT 2
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1_MASK 0x3C0
#define R356_SPDIF_RX_DECODE_RX_WORDLENGTH_R_IC_1_SHIFT 6

/* SPDIF_RX_COMPRMODE (IC 1) */
#define R357_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1   0x0000 /* 0000000000000000b	[15:0] */
#define R357_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1_MASK 0xFFFF
#define R357_SPDIF_RX_COMPRMODE_COMPR_MODE_IC_1_SHIFT 0

/* SPDIF_RESTART (IC 1) */
#define R358_SPDIF_RESTART_RESTART_AUDIO_IC_1     0x0    /* 0b	[0] */
#define R358_SPDIF_RESTART_RESTART_AUDIO_IC_1_MASK 0x1
#define R358_SPDIF_RESTART_RESTART_AUDIO_IC_1_SHIFT 0

/* SPDIF_LOSS_OF_LOCK (IC 1) */
#define R359_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1 0x0    /* 0b	[0] */
#define R359_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1_MASK 0x1
#define R359_SPDIF_LOSS_OF_LOCK_LOSS_OF_LOCK_IC_1_SHIFT 0

/* SPDIF_RX_MCLKSPEED (IC 1) */
#define R360_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1 0x1    /* 1b	[0] */
#define R360_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1_MASK 0x1
#define R360_SPDIF_RX_MCLKSPEED_RX_MCLKSPEED_IC_1_SHIFT 0

/* SPDIF_TX_MCLKSPEED (IC 1) */
#define R361_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1 0x1    /* 1b	[0] */
#define R361_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1_MASK 0x1
#define R361_SPDIF_TX_MCLKSPEED_TX_MCLKSPEED_IC_1_SHIFT 0

/* SPDIF_AUX_EN (IC 1) */
#define R362_SPDIF_AUX_EN_TDMOUT_IC_1             0x0    /* 0000b	[3:0] */
#define R362_SPDIF_AUX_EN_TDMOUT_CLK_IC_1         0x0    /* 0b	[4] */
#define R362_SPDIF_AUX_EN_TDMOUT_IC_1_MASK        0xF
#define R362_SPDIF_AUX_EN_TDMOUT_IC_1_SHIFT       0
#define R362_SPDIF_AUX_EN_TDMOUT_CLK_IC_1_MASK    0x10
#define R362_SPDIF_AUX_EN_TDMOUT_CLK_IC_1_SHIFT   4

/* SPDIF_RX_AUXBIT_READY (IC 1) */
#define R363_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1 0x0 /* 0b	[0] */
#define R363_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1_MASK 0x1
#define R363_SPDIF_RX_AUXBIT_READY_AUXBITS_READY_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_0 (IC 1) */
#define R364_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R364_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R364_SPDIF_RX_CS_LEFT_0_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_1 (IC 1) */
#define R365_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R365_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R365_SPDIF_RX_CS_LEFT_1_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_2 (IC 1) */
#define R366_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R366_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R366_SPDIF_RX_CS_LEFT_2_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_CS_LEFT_3 (IC 1) */
#define R367_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R367_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1_MASK 0xFFFF
#define R367_SPDIF_RX_CS_LEFT_3_SPDIF_RX_CS_LEFT_IC_1_SHIFT 0

