nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* SPDIF_RX_PB_LEFT_10 (IC 1) */
#define R446_SPDIF_RX_PB_LEFT_10_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R446_SPDIF_RX_PB_LEFT_10_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R446_SPDIF_RX_PB_LEFT_10_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_11 (IC 1) */
#define R447_SPDIF_RX_PB_LEFT_11_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R447_SPDIF_RX_PB_LEFT_11_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R447_SPDIF_RX_PB_LEFT_11_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_0 (IC 1) */
#define R448_SPDIF_RX_PB_RIGHT_0_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R448_SPDIF_RX_PB_RIGHT_0_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R448_SPDIF_RX_PB_RIGHT_0_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_1 (IC 1) */
#define R449_SPDIF_RX_PB_RIGHT_1_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R449_SPDIF_RX_PB_RIGHT_1_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R449_SPDIF_RX_PB_RIGHT_1_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_2 (IC 1) */
#define R450_SPDIF_RX_PB_RIGHT_2_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R450_SPDIF_RX_PB_RIGHT_2_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R450_SPDIF_RX_PB_RIGHT_2_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_3 (IC 1) */
#define R451_SPDIF_RX_PB_RIGHT_3_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R451_SPDIF_RX_PB_RIGHT_3_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R451_SPDIF_RX_PB_RIGHT_3_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_4 (IC 1) */
#define R452_SPDIF_RX_PB_RIGHT_4_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R452_SPDIF_RX_PB_RIGHT_4_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R452_SPDIF_RX_PB_RIGHT_4_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_5 (IC 1) */
#define R453_SPDIF_RX_PB_RIGHT_5_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R453_SPDIF_RX_PB_RIGHT_5_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R453_SPDIF_RX_PB_RIGHT_5_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_6 (IC 1) */
#define R454_SPDIF_RX_PB_RIGHT_6_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R454_SPDIF_RX_PB_RIGHT_6_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R454_SPDIF_RX_PB_RIGHT_6_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_7 (IC 1) */
#define R455_SPDIF_RX_PB_RIGHT_7_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R455_SPDIF_RX_PB_RIGHT_7_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R455_SPDIF_RX_PB_RIGHT_7_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_8 (IC 1) */
#define R456_SPDIF_RX_PB_RIGHT_8_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R456_SPDIF_RX_PB_RIGHT_8_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R456_SPDIF_RX_PB_RIGHT_8_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_9 (IC 1) */
#define R457_SPDIF_RX_PB_RIGHT_9_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R457_SPDIF_RX_PB_RIGHT_9_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R457_SPDIF_RX_PB_RIGHT_9_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_10 (IC 1) */
#define R458_SPDIF_RX_PB_RIGHT_10_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R458_SPDIF_RX_PB_RIGHT_10_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R458_SPDIF_RX_PB_RIGHT_10_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_RIGHT_11 (IC 1) */
#define R459_SPDIF_RX_PB_RIGHT_11_SPDIF_RX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R459_SPDIF_RX_PB_RIGHT_11_SPDIF_RX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R459_SPDIF_RX_PB_RIGHT_11_SPDIF_RX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_EN (IC 1) */
#define R460_SPDIF_TX_EN_TXEN_IC_1                0x0    /* 0b	[0] */
#define R460_SPDIF_TX_EN_TXEN_IC_1_MASK           0x1
#define R460_SPDIF_TX_EN_TXEN_IC_1_SHIFT          0

/* SPDIF_TX_CTRL (IC 1) */
#define R461_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1     0x0    /* 00b	[1:0] */
#define R461_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1_MASK 0x3
#define R461_SPDIF_TX_CTRL_TX_LENGTHCTRL_IC_1_SHIFT 0

/* SPDIF_TX_AUXBIT_SOURCE (IC 1) */
#define R462_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1 0x0 /* 0b	[0] */
#define R462_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1_MASK 0x1
#define R462_SPDIF_TX_AUXBIT_SOURCE_TX_AUXBITS_SOURCE_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_0 (IC 1) */
#define R463_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R463_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R463_SPDIF_TX_CS_LEFT_0_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_1 (IC 1) */
#define R464_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R464_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R464_SPDIF_TX_CS_LEFT_1_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_2 (IC 1) */
#define R465_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R465_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R465_SPDIF_TX_CS_LEFT_2_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_3 (IC 1) */
#define R466_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R466_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R466_SPDIF_TX_CS_LEFT_3_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_4 (IC 1) */
#define R467_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R467_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R467_SPDIF_TX_CS_LEFT_4_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_5 (IC 1) */
#define R468_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R468_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R468_SPDIF_TX_CS_LEFT_5_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_6 (IC 1) */
#define R469_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R469_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R469_SPDIF_TX_CS_LEFT_6_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_7 (IC 1) */
#define R470_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R470_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R470_SPDIF_TX_CS_LEFT_7_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_8 (IC 1) */
#define R471_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R471_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R471_SPDIF_TX_CS_LEFT_8_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_9 (IC 1) */
#define R472_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R472_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R472_SPDIF_TX_CS_LEFT_9_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_10 (IC 1) */
#define R473_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R473_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R473_SPDIF_TX_CS_LEFT_10_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_CS_LEFT_11 (IC 1) */
#define R474_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R474_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1_MASK 0xFFFF
#define R474_SPDIF_TX_CS_LEFT_11_SPDIF_TX_CS_LEFT_IC_1_SHIFT 0

