nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* SPDIF_TX_PB_RIGHT_2 (IC 1) */
#define R549_SPDIF_TX_PB_RIGHT_2_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R549_SPDIF_TX_PB_RIGHT_2_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R549_SPDIF_TX_PB_RIGHT_2_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_3 (IC 1) */
#define R550_SPDIF_TX_PB_RIGHT_3_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R550_SPDIF_TX_PB_RIGHT_3_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R550_SPDIF_TX_PB_RIGHT_3_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_4 (IC 1) */
#define R551_SPDIF_TX_PB_RIGHT_4_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R551_SPDIF_TX_PB_RIGHT_4_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R551_SPDIF_TX_PB_RIGHT_4_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_5 (IC 1) */
#define R552_SPDIF_TX_PB_RIGHT_5_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R552_SPDIF_TX_PB_RIGHT_5_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R552_SPDIF_TX_PB_RIGHT_5_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_6 (IC 1) */
#define R553_SPDIF_TX_PB_RIGHT_6_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R553_SPDIF_TX_PB_RIGHT_6_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R553_SPDIF_TX_PB_RIGHT_6_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_7 (IC 1) */
#define R554_SPDIF_TX_PB_RIGHT_7_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R554_SPDIF_TX_PB_RIGHT_7_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R554_SPDIF_TX_PB_RIGHT_7_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_8 (IC 1) */
#define R555_SPDIF_TX_PB_RIGHT_8_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R555_SPDIF_TX_PB_RIGHT_8_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R555_SPDIF_TX_PB_RIGHT_8_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_9 (IC 1) */
#define R556_SPDIF_TX_PB_RIGHT_9_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R556_SPDIF_TX_PB_RIGHT_9_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R556_SPDIF_TX_PB_RIGHT_9_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_10 (IC 1) */
#define R557_SPDIF_TX_PB_RIGHT_10_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R557_SPDIF_TX_PB_RIGHT_10_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R557_SPDIF_TX_PB_RIGHT_10_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_PB_RIGHT_11 (IC 1) */
#define R558_SPDIF_TX_PB_RIGHT_11_SPDIF_TX_PB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R558_SPDIF_TX_PB_RIGHT_11_SPDIF_TX_PB_RIGHT_IC_1_MASK 0xFFFF
#define R558_SPDIF_TX_PB_RIGHT_11_SPDIF_TX_PB_RIGHT_IC_1_SHIFT 0

/* BCLK_IN0_PIN (IC 1) */
#define R559_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R559_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R559_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R559_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R559_BCLK_IN0_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R559_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R559_BCLK_IN0_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R559_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R559_BCLK_IN0_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN1_PIN (IC 1) */
#define R560_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R560_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R560_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R560_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R560_BCLK_IN1_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R560_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R560_BCLK_IN1_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R560_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R560_BCLK_IN1_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN2_PIN (IC 1) */
#define R561_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R561_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R561_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R561_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R561_BCLK_IN2_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R561_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R561_BCLK_IN2_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R561_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R561_BCLK_IN2_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_IN3_PIN (IC 1) */
#define R562_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1      0x0    /* 00b	[1:0] */
#define R562_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1       0x2    /* 10b	[3:2] */
#define R562_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1       0x1    /* 1b	[4] */
#define R562_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1_MASK 0x3
#define R562_BCLK_IN3_PIN_BCLK_IN_DRIVE_IC_1_SHIFT 0
#define R562_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1_MASK  0xC
#define R562_BCLK_IN3_PIN_BCLK_IN_SLEW_IC_1_SHIFT 2
#define R562_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1_MASK  0x10
#define R562_BCLK_IN3_PIN_BCLK_IN_PULL_IC_1_SHIFT 4

/* BCLK_OUT0_PIN (IC 1) */
#define R563_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R563_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R563_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R563_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R563_BCLK_OUT0_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R563_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R563_BCLK_OUT0_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R563_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R563_BCLK_OUT0_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT1_PIN (IC 1) */
#define R564_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R564_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R564_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R564_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R564_BCLK_OUT1_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R564_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R564_BCLK_OUT1_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R564_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R564_BCLK_OUT1_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT2_PIN (IC 1) */
#define R565_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R565_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R565_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R565_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R565_BCLK_OUT2_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R565_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R565_BCLK_OUT2_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R565_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R565_BCLK_OUT2_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* BCLK_OUT3_PIN (IC 1) */
#define R566_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R566_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R566_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1     0x1    /* 1b	[4] */
#define R566_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R566_BCLK_OUT3_PIN_BCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R566_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1_MASK 0xC
#define R566_BCLK_OUT3_PIN_BCLK_OUT_SLEW_IC_1_SHIFT 2
#define R566_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1_MASK 0x10
#define R566_BCLK_OUT3_PIN_BCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_IN0_PIN (IC 1) */
#define R567_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R567_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R567_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R567_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R567_LRCLK_IN0_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R567_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R567_LRCLK_IN0_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R567_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R567_LRCLK_IN0_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN1_PIN (IC 1) */
#define R568_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R568_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R568_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R568_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R568_LRCLK_IN1_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R568_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R568_LRCLK_IN1_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R568_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R568_LRCLK_IN1_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN2_PIN (IC 1) */
#define R569_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R569_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R569_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R569_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R569_LRCLK_IN2_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R569_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R569_LRCLK_IN2_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R569_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R569_LRCLK_IN2_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_IN3_PIN (IC 1) */
#define R570_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R570_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R570_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R570_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1_MASK 0x3
#define R570_LRCLK_IN3_PIN_LRCLK_IN_DRIVE_IC_1_SHIFT 0
#define R570_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1_MASK 0xC
#define R570_LRCLK_IN3_PIN_LRCLK_IN_SLEW_IC_1_SHIFT 2
#define R570_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1_MASK 0x10
#define R570_LRCLK_IN3_PIN_LRCLK_IN_PULL_IC_1_SHIFT 4

/* LRCLK_OUT0_PIN (IC 1) */
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R571_LRCLK_OUT0_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT1_PIN (IC 1) */
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R572_LRCLK_OUT1_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT2_PIN (IC 1) */
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R573_LRCLK_OUT2_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* LRCLK_OUT3_PIN (IC 1) */
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1   0x1    /* 1b	[4] */
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1_MASK 0x3
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_DRIVE_IC_1_SHIFT 0
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1_MASK 0xC
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_SLEW_IC_1_SHIFT 2
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1_MASK 0x10
#define R574_LRCLK_OUT3_PIN_LRCLK_OUT_PULL_IC_1_SHIFT 4

/* SDATA_IN0_PIN (IC 1) */
#define R575_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R575_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R575_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R575_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R575_SDATA_IN0_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R575_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R575_SDATA_IN0_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R575_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R575_SDATA_IN0_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_IN1_PIN (IC 1) */
#define R576_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R576_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R576_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R576_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R576_SDATA_IN1_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R576_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R576_SDATA_IN1_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R576_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R576_SDATA_IN1_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

