nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* SDATA_IN2_PIN (IC 1) */
#define R577_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R577_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R577_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R577_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R577_SDATA_IN2_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R577_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R577_SDATA_IN2_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R577_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R577_SDATA_IN2_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_IN3_PIN (IC 1) */
#define R578_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R578_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R578_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1     0x1    /* 1b	[4] */
#define R578_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_MASK 0x3
#define R578_SDATA_IN3_PIN_SDATA_IN_DRIVE_IC_1_SHIFT 0
#define R578_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_MASK 0xC
#define R578_SDATA_IN3_PIN_SDATA_IN_SLEW_IC_1_SHIFT 2
#define R578_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_MASK 0x10
#define R578_SDATA_IN3_PIN_SDATA_IN_PULL_IC_1_SHIFT 4

/* SDATA_OUT0_PIN (IC 1) */
#define R579_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R579_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R579_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R579_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R579_SDATA_OUT0_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R579_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R579_SDATA_OUT0_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R579_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R579_SDATA_OUT0_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT1_PIN (IC 1) */
#define R580_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R580_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R580_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R580_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R580_SDATA_OUT1_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R580_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R580_SDATA_OUT1_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R580_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R580_SDATA_OUT1_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT2_PIN (IC 1) */
#define R581_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R581_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R581_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R581_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R581_SDATA_OUT2_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R581_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R581_SDATA_OUT2_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R581_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R581_SDATA_OUT2_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SDATA_OUT3_PIN (IC 1) */
#define R582_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1  0x0    /* 00b	[1:0] */
#define R582_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1   0x2    /* 10b	[3:2] */
#define R582_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1   0x0    /* 0b	[4] */
#define R582_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_MASK 0x3
#define R582_SDATA_OUT3_PIN_SDATA_OUT_DRIVE_IC_1_SHIFT 0
#define R582_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_MASK 0xC
#define R582_SDATA_OUT3_PIN_SDATA_OUT_SLEW_IC_1_SHIFT 2
#define R582_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_MASK 0x10
#define R582_SDATA_OUT3_PIN_SDATA_OUT_PULL_IC_1_SHIFT 4

/* SPDIF_TX_PIN (IC 1) */
#define R583_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R583_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R583_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1      0x0    /* 0b	[4] */
#define R583_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_MASK 0x3
#define R583_SPDIF_TX_PIN_SPDIF_TX_DRIVE_IC_1_SHIFT 0
#define R583_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_MASK 0xC
#define R583_SPDIF_TX_PIN_SPDIF_TX_SLEW_IC_1_SHIFT 2
#define R583_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_MASK 0x10
#define R583_SPDIF_TX_PIN_SPDIF_TX_PULL_IC_1_SHIFT 4

/* SCLK_SCL_PIN (IC 1) */
#define R584_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R584_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R584_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1      0x0    /* 0b	[4] */
#define R584_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_MASK 0x3
#define R584_SCLK_SCL_PIN_SCLK_SCL_DRIVE_IC_1_SHIFT 0
#define R584_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_MASK 0xC
#define R584_SCLK_SCL_PIN_SCLK_SCL_SLEW_IC_1_SHIFT 2
#define R584_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_MASK 0x10
#define R584_SCLK_SCL_PIN_SCLK_SCL_PULL_IC_1_SHIFT 4

/* MISO_SDA_PIN (IC 1) */
#define R585_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1     0x0    /* 00b	[1:0] */
#define R585_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1      0x2    /* 10b	[3:2] */
#define R585_MISO_SDA_PIN_MISO_SDA_PULL_IC_1      0x0    /* 0b	[4] */
#define R585_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_MASK 0x3
#define R585_MISO_SDA_PIN_MISO_SDA_DRIVE_IC_1_SHIFT 0
#define R585_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_MASK 0xC
#define R585_MISO_SDA_PIN_MISO_SDA_SLEW_IC_1_SHIFT 2
#define R585_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_MASK 0x10
#define R585_MISO_SDA_PIN_MISO_SDA_PULL_IC_1_SHIFT 4

/* SS_PIN (IC 1) */
#define R586_SS_PIN_SS_DRIVE_IC_1                 0x0    /* 00b	[1:0] */
#define R586_SS_PIN_SS_SLEW_IC_1                  0x2    /* 10b	[3:2] */
#define R586_SS_PIN_SS_PULL_IC_1                  0x1    /* 1b	[4] */
#define R586_SS_PIN_SS_DRIVE_IC_1_MASK            0x3
#define R586_SS_PIN_SS_DRIVE_IC_1_SHIFT           0
#define R586_SS_PIN_SS_SLEW_IC_1_MASK             0xC
#define R586_SS_PIN_SS_SLEW_IC_1_SHIFT            2
#define R586_SS_PIN_SS_PULL_IC_1_MASK             0x10
#define R586_SS_PIN_SS_PULL_IC_1_SHIFT            4

/* MOSI_ADDR1_PIN (IC 1) */
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1  0x1    /* 1b	[4] */
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_MASK 0x3
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_DRIVE_IC_1_SHIFT 0
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_MASK 0xC
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_SLEW_IC_1_SHIFT 2
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_MASK 0x10
#define R587_MOSI_ADDR1_PIN_MOSI_ADDR1_PULL_IC_1_SHIFT 4

/* SCLK_SCL_M_PIN (IC 1) */
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_MASK 0x3
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_DRIVE_IC_1_SHIFT 0
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_MASK 0xC
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_SLEW_IC_1_SHIFT 2
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_MASK 0x10
#define R588_SCLK_SCL_M_PIN_SCLK_SCL_M_PULL_IC_1_SHIFT 4

/* MISO_SDA_M_PIN (IC 1) */
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1 0x0    /* 00b	[1:0] */
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1  0x2    /* 10b	[3:2] */
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1  0x0    /* 0b	[4] */
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_MASK 0x3
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_DRIVE_IC_1_SHIFT 0
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_MASK 0xC
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_SLEW_IC_1_SHIFT 2
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_MASK 0x10
#define R589_MISO_SDA_M_PIN_MISO_SDA_M_PULL_IC_1_SHIFT 4

/* SS_M_PIN (IC 1) */
#define R590_SS_M_PIN_SS_M_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R590_SS_M_PIN_SS_M_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R590_SS_M_PIN_SS_M_PULL_IC_1              0x1    /* 1b	[4] */
#define R590_SS_M_PIN_SS_M_DRIVE_IC_1_MASK        0x3
#define R590_SS_M_PIN_SS_M_DRIVE_IC_1_SHIFT       0
#define R590_SS_M_PIN_SS_M_SLEW_IC_1_MASK         0xC
#define R590_SS_M_PIN_SS_M_SLEW_IC_1_SHIFT        2
#define R590_SS_M_PIN_SS_M_PULL_IC_1_MASK         0x10
#define R590_SS_M_PIN_SS_M_PULL_IC_1_SHIFT        4

