nguyenhoabinhworkplace/ESP32_sigmastudio_control/teensy_sigmadsp_example_project_1.1.0/src/SigmaStudioFiles/Simple_SS_Project_145x_146x_IC_1_REG.h
/* MOSI_M_PIN (IC 1) */
#define R591_MOSI_M_PIN_MOSI_M_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R591_MOSI_M_PIN_MOSI_M_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R591_MOSI_M_PIN_MOSI_M_PULL_IC_1          0x1    /* 1b	[4] */
#define R591_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_MASK    0x3
#define R591_MOSI_M_PIN_MOSI_M_DRIVE_IC_1_SHIFT   0
#define R591_MOSI_M_PIN_MOSI_M_SLEW_IC_1_MASK     0xC
#define R591_MOSI_M_PIN_MOSI_M_SLEW_IC_1_SHIFT    2
#define R591_MOSI_M_PIN_MOSI_M_PULL_IC_1_MASK     0x10
#define R591_MOSI_M_PIN_MOSI_M_PULL_IC_1_SHIFT    4

/* MP6_PIN (IC 1) */
#define R592_MP6_PIN_MP6_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R592_MP6_PIN_MP6_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R592_MP6_PIN_MP6_PULL_IC_1                0x1    /* 1b	[4] */
#define R592_MP6_PIN_MP6_DRIVE_IC_1_MASK          0x3
#define R592_MP6_PIN_MP6_DRIVE_IC_1_SHIFT         0
#define R592_MP6_PIN_MP6_SLEW_IC_1_MASK           0xC
#define R592_MP6_PIN_MP6_SLEW_IC_1_SHIFT          2
#define R592_MP6_PIN_MP6_PULL_IC_1_MASK           0x10
#define R592_MP6_PIN_MP6_PULL_IC_1_SHIFT          4

/* MP7_PIN (IC 1) */
#define R593_MP7_PIN_MP7_DRIVE_IC_1               0x0    /* 00b	[1:0] */
#define R593_MP7_PIN_MP7_SLEW_IC_1                0x2    /* 10b	[3:2] */
#define R593_MP7_PIN_MP7_PULL_IC_1                0x1    /* 1b	[4] */
#define R593_MP7_PIN_MP7_DRIVE_IC_1_MASK          0x3
#define R593_MP7_PIN_MP7_DRIVE_IC_1_SHIFT         0
#define R593_MP7_PIN_MP7_SLEW_IC_1_MASK           0xC
#define R593_MP7_PIN_MP7_SLEW_IC_1_SHIFT          2
#define R593_MP7_PIN_MP7_PULL_IC_1_MASK           0x10
#define R593_MP7_PIN_MP7_PULL_IC_1_SHIFT          4

/* CLKOUT_PIN (IC 1) */
#define R594_CLKOUT_PIN_CLKOUT_DRIVE_IC_1         0x0    /* 00b	[1:0] */
#define R594_CLKOUT_PIN_CLKOUT_SLEW_IC_1          0x2    /* 10b	[3:2] */
#define R594_CLKOUT_PIN_CLKOUT_PULL_IC_1          0x0    /* 0b	[4] */
#define R594_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_MASK    0x3
#define R594_CLKOUT_PIN_CLKOUT_DRIVE_IC_1_SHIFT   0
#define R594_CLKOUT_PIN_CLKOUT_SLEW_IC_1_MASK     0xC
#define R594_CLKOUT_PIN_CLKOUT_SLEW_IC_1_SHIFT    2
#define R594_CLKOUT_PIN_CLKOUT_PULL_IC_1_MASK     0x10
#define R594_CLKOUT_PIN_CLKOUT_PULL_IC_1_SHIFT    4

/* MP14_PIN (IC 1) */
#define R595_MP14_PIN_MP14_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R595_MP14_PIN_MP14_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R595_MP14_PIN_MP14_PULL_IC_1              0x1    /* 1b	[4] */
#define R595_MP14_PIN_MP14_DRIVE_IC_1_MASK        0x3
#define R595_MP14_PIN_MP14_DRIVE_IC_1_SHIFT       0
#define R595_MP14_PIN_MP14_SLEW_IC_1_MASK         0xC
#define R595_MP14_PIN_MP14_SLEW_IC_1_SHIFT        2
#define R595_MP14_PIN_MP14_PULL_IC_1_MASK         0x10
#define R595_MP14_PIN_MP14_PULL_IC_1_SHIFT        4

/* MP15_PIN (IC 1) */
#define R596_MP15_PIN_MP15_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R596_MP15_PIN_MP15_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R596_MP15_PIN_MP15_PULL_IC_1              0x1    /* 1b	[4] */
#define R596_MP15_PIN_MP15_DRIVE_IC_1_MASK        0x3
#define R596_MP15_PIN_MP15_DRIVE_IC_1_SHIFT       0
#define R596_MP15_PIN_MP15_SLEW_IC_1_MASK         0xC
#define R596_MP15_PIN_MP15_SLEW_IC_1_SHIFT        2
#define R596_MP15_PIN_MP15_PULL_IC_1_MASK         0x10
#define R596_MP15_PIN_MP15_PULL_IC_1_SHIFT        4

/* SDATA_IO0_PIN (IC 1) */
#define R597_SDATA_IO0_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R597_SDATA_IO0_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R597_SDATA_IO0_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R597_SDATA_IO0_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R597_SDATA_IO0_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R597_SDATA_IO0_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R597_SDATA_IO0_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R597_SDATA_IO0_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R597_SDATA_IO0_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO1_PIN (IC 1) */
#define R598_SDATA_IO1_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R598_SDATA_IO1_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R598_SDATA_IO1_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R598_SDATA_IO1_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R598_SDATA_IO1_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R598_SDATA_IO1_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R598_SDATA_IO1_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R598_SDATA_IO1_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R598_SDATA_IO1_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO2_PIN (IC 1) */
#define R599_SDATA_IO2_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R599_SDATA_IO2_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R599_SDATA_IO2_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R599_SDATA_IO2_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R599_SDATA_IO2_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R599_SDATA_IO2_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R599_SDATA_IO2_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R599_SDATA_IO2_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R599_SDATA_IO2_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO3_PIN (IC 1) */
#define R600_SDATA_IO3_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R600_SDATA_IO3_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R600_SDATA_IO3_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R600_SDATA_IO3_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R600_SDATA_IO3_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R600_SDATA_IO3_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R600_SDATA_IO3_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R600_SDATA_IO3_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R600_SDATA_IO3_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO4_PIN (IC 1) */
#define R601_SDATA_IO4_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R601_SDATA_IO4_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R601_SDATA_IO4_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R601_SDATA_IO4_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R601_SDATA_IO4_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R601_SDATA_IO4_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R601_SDATA_IO4_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R601_SDATA_IO4_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R601_SDATA_IO4_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO5_PIN (IC 1) */
#define R602_SDATA_IO5_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R602_SDATA_IO5_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R602_SDATA_IO5_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R602_SDATA_IO5_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R602_SDATA_IO5_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R602_SDATA_IO5_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R602_SDATA_IO5_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R602_SDATA_IO5_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R602_SDATA_IO5_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO6_PIN (IC 1) */
#define R603_SDATA_IO6_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R603_SDATA_IO6_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R603_SDATA_IO6_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R603_SDATA_IO6_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R603_SDATA_IO6_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R603_SDATA_IO6_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R603_SDATA_IO6_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R603_SDATA_IO6_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R603_SDATA_IO6_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* SDATA_IO7_PIN (IC 1) */
#define R604_SDATA_IO7_PIN_SDATA_IO_DRIVE_IC_1    0x0    /* 00b	[1:0] */
#define R604_SDATA_IO7_PIN_SDATA_IO_SLEW_IC_1     0x2    /* 10b	[3:2] */
#define R604_SDATA_IO7_PIN_SDATA_IO_PULL_IC_1     0x1    /* 1b	[4] */
#define R604_SDATA_IO7_PIN_SDATA_IO_DRIVE_IC_1_MASK 0x3
#define R604_SDATA_IO7_PIN_SDATA_IO_DRIVE_IC_1_SHIFT 0
#define R604_SDATA_IO7_PIN_SDATA_IO_SLEW_IC_1_MASK 0xC
#define R604_SDATA_IO7_PIN_SDATA_IO_SLEW_IC_1_SHIFT 2
#define R604_SDATA_IO7_PIN_SDATA_IO_PULL_IC_1_MASK 0x10
#define R604_SDATA_IO7_PIN_SDATA_IO_PULL_IC_1_SHIFT 4

/* MP24_PIN (IC 1) */
#define R605_MP24_PIN_MP24_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R605_MP24_PIN_MP24_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R605_MP24_PIN_MP24_PULL_IC_1              0x0    /* 0b	[4] */
#define R605_MP24_PIN_MP24_DRIVE_IC_1_MASK        0x3
#define R605_MP24_PIN_MP24_DRIVE_IC_1_SHIFT       0
#define R605_MP24_PIN_MP24_SLEW_IC_1_MASK         0xC
#define R605_MP24_PIN_MP24_SLEW_IC_1_SHIFT        2
#define R605_MP24_PIN_MP24_PULL_IC_1_MASK         0x10
#define R605_MP24_PIN_MP24_PULL_IC_1_SHIFT        4

/* MP25_PIN (IC 1) */
#define R606_MP25_PIN_MP25_DRIVE_IC_1             0x0    /* 00b	[1:0] */
#define R606_MP25_PIN_MP25_SLEW_IC_1              0x2    /* 10b	[3:2] */
#define R606_MP25_PIN_MP25_PULL_IC_1              0x0    /* 0b	[4] */
#define R606_MP25_PIN_MP25_DRIVE_IC_1_MASK        0x3
#define R606_MP25_PIN_MP25_DRIVE_IC_1_SHIFT       0
#define R606_MP25_PIN_MP25_SLEW_IC_1_MASK         0xC
#define R606_MP25_PIN_MP25_SLEW_IC_1_SHIFT        2
#define R606_MP25_PIN_MP25_PULL_IC_1_MASK         0x10
#define R606_MP25_PIN_MP25_PULL_IC_1_SHIFT        4

/* SOFT_RESET (IC 1) */
#define R607_SOFTWARE_RESET_IC_1                  0x1    /* 1b	[0] */
#define R607_SOFTWARE_RESET_IC_1_MASK             0x1
#define R607_SOFTWARE_RESET_IC_1_SHIFT            0

/* SECOND_PAGE_ENABLE (IC 1) */
#define R608_SECOND_PAGE_ENABLE_IC_1              0x0    /* 0b	[0] */
#define R608_SECOND_PAGE_ENABLE_IC_1_MASK         0x1
#define R608_SECOND_PAGE_ENABLE_IC_1_SHIFT        0

#endif
